app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def index
    @story = Story.find(:first, :order => 'RANDOM()')

INSERT INTO "stories" ("name", "created_at", "updated_at", "link") VALUES(NULL, '2010-06-24 19:23:04', '2010-06-24 19:23:04', NULL)
---
  def create
    @story=Story.new(params[:story])
    if @story.save

SELECT * FROM "stories" WHERE ("stories"."id" = 6)
---
  def show
    @story = Story.find(params[:id])