app/controllers/votes_controller.rb

  def create
    @story = Story.find(params[:story_id])
    @story.votes.create
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)
INSERT INTO "votes" ("created_at", "updated_at", "story_id") VALUES('2010-06-29 18:43:57', '2010-06-29 18:43:57', 1)